INSERT INTO genre (genre_name) VALUES 
    ('Детектив'), 
    ('Классика'), 
    ('Фантастика'),
    ('Роман'),
    ('Научная фантастика'),
    ('История'),
    ('Детская литература'),
    ('Фентези'),
    ('Приключения')
;

INSERT INTO author (first_name, last_name, middle_name) VALUES
   ('Толстой', 'Лев', 'Николаевич'),
   ('Твен', 'Марк', null),
   ('Толкин', 'Джон', 'Рональд Руэл'),
   ('Кинг', 'Стивен', null)
;

INSERT INTO book (author_id, name) VALUES 
    (1, 'Война и мир'),
    (1, 'Анна Каренина'),
    (1, 'Детство'),
    (2, 'Приключение Тома Соера'),
    (3, 'Властилин колец'),
    (3, 'Хоббит, или туда и обратно'),
    (4, 'Оно'),
    (4, 'Кладбище домашних животных')
;

INSERT INTO book_genre (book_id, genre_id) VALUES
    (1, 2),
    (2, 2),
    (3, 2),
    (4, 4),
    (4, 7),
    (4, 9),
    (5, 8),
    (5, 9),
    (6, 8),
    (6, 9),
    (7, 4),
    (8, 4)
;

INSERT INTO person (first_name, last_name, middle_name, birth_date) VALUES
    ('Новикова', 'Ксения', 'Данииловна', '1980-08-11'),
    ('Рыжов', 'Артём', 'Тимофеевич', '1987-08-18'),
    ('Лукин', 'Мирон', 'Степанович', '2002-01-31'),
    ('Маслова', 'Аделина', 'Матвеевна', '1996-10-21')
;

INSERT INTO library_card (person_id, book_id) VALUES
    (1, 1),
    (1, 2),
    (1, 3),
    (3, 7),
    (3, 8),
    (4, 5),
    (4, 6)
;